[
    {
        "key": "",
        "category": "Music",
        "title": "The Pixies and lyrics",
        "dates": "03/10/2023",
        "content": "I am a 42 year old man. I am sitting on my scandavsvian designed chair, in my townhouse. I have a finger of whiskey on ice. I’m watching a documentary about the pixies. A YouTube video essay really. Black Francis explains his lyric writing process as listening to the chord progression and hearing five words. Five words might mean something. The lines before and after might mean something else. I am crying because 1. I love the pixies 2. I am NOT a lyrics guy. Music is about vibes and the instrumental music. And I suspect a lot of lyrics has very little actual meaning to the artist in popular music. We hear what we want, because the devil is six, and if the devil is six, then god is seven; this monkeys gone to heaven"
    },
    {
        "key": "",
        "category": "App Idea",
        "title": "WIP",
        "dates": "06/04/2021",
        "content": "Spotify to YouTube app called SpottyOttyYouTubelicious"
    },
    {
        "key": "",
        "category": "Video Games",
        "title": "Elder Scrolls: Arena",
        "dates": "Years ago...",
        "content": "I have great memories of video games in my life. They will forever be linked to some of my favorite people. The top two on that list being my father and brother. Though we have had many adventures, across a multitude of platforms, the one that will always stand out is when we collectively saved the lands of Tamriel from the vile battlemage Jagar Tharn.... Only, we never did. It started at the beginning of the summer... I’ve since lost track of which one. Many evenings would go something like this: Two of us feverishly loading dishes, wiping counters and tables, and storing food after dinner while the other one secretly stole away to the basement to boot up that old Drake desktop. By the time the chores had been taken care of and Mom was engaged in the night time ritual of prepping the two youngest siblings for bed, the world of Tamriel would be loaded. We would spend hours hunkered around the old 486dx that summer. We would do it as a team. We made a first person RPG a team event. We all had a job. Teammate 1: Operate the mouse. This was a coveted position and hotly contested. It normally fell to Dad, by default. It entailed moving the character, interacting with the environment, and guiding the weapon of our brave knight through intense battles. It was an enviable job. My brother and I craved to know the feeling of victory, but we were happy to relinquish the blade, axe, warhammer, or mace to our Dad; we knew that his strikes were true. Teammate 2: Navigate the character. This required expert use of the arrow keys to move our knight forward, backward, and strafing left and right. The spacebar for jumping was also employed, and during the heat of a battle, you had to work harmoniously with your weapon guiding teammate. Teammate 3: Potion of Healing. Never to be underappreciated was the one locked on the F1 key. The Potion of Heal True was the brave Norse Knight’s best friend when surrounded by a gang of wraiths and the first one to draw the ire of the other teammates should brave Lancelot meet his doom. The basement became our domain. We nicknamed it “The Dungeon”. We spent so many hours shoulder to shoulder working our way through the fabulously crafted storyline. We explored the forests outside the cities. We knew where to find all the best shops in every city. We explored every dungeon, ensuring that every treasure pile and chest was pillaged. The quests never ended until we had nothing but the best weapon and armor. It was all Ebony everything and it crossed into our normal lives. An accidental headbutt while wrestling was not just a hard head; it was an Ebony Dai-Cranium of Skull Bash. We worked our way through countless hours of quests. We cheered when a prized piece was found or difficult enemy bested. We lamented the loss of progress after every death following a long period without a save. We argued after each consecutive defeat at the hands of a difficult boss. We bonded and we enjoyed doing this thing together. Then we came to the end. Jagar Tharn. We had assembled the Staff of Chaos. We had the rarest armor and weapons. We were unbeatable. We destroyed the evil Tharn in a matter of seconds. He was no match for might of our knight. We relished in the exuberance that would surely come next. We clicked to pass through the portal and.... nothing. We wiggled the mouse and there was no response. Pressed escape... no response. Ctrl-alt-del... Elder Scrolls is not responding. We never beat Tharn. The game had a bug. We never received the praise, gratitude, and adulation of the population of Tamriel. We did, however, have a summer that none of us have ever forgotten. Our youngest brother still has the Ebony Dai-Cranium of Skull Bash. "
    }
]